app/Controllers/KaryawanController.php

SELECT *
FROM `karyawan`
---
    public function index()
    {
        $data['karyawan'] = $this->model->findAll();

SELECT *
FROM `karyawan`
WHERE `karyawan`.`id` = '3'
---
    public function edit($id)
    {
        $data['karyawan'] = $this->model->find($id);